<template>
    <div class="container-fluid">
        <div class="col-md-8 mx-auto cards-content">
            <div class="row">
                <div class="col-md-4 px-0 language-content " :class="{ active: langActive }"
                     @click="activeClick('lang')">
                    <div class="card card-language mx-2">
                        <div class="card-body">
                            <div class="card-language-icon">
                                <svg width="40" height="40" viewBox="0 0 40 40" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path
                                        d="M23.3333 10.0001H6.66667C6.22464 10.0001 5.80072 9.82449 5.48816 9.51193C5.17559 9.19937 5 8.77544 5 8.33342C5 7.89139 5.17559 7.46746 5.48816 7.1549C5.80072 6.84234 6.22464 6.66675 6.66667 6.66675H23.3333C23.7754 6.66675 24.1993 6.84234 24.5118 7.1549C24.8244 7.46746 25 7.89139 25 8.33342C25 8.77544 24.8244 9.19937 24.5118 9.51193C24.1993 9.82449 23.7754 10.0001 23.3333 10.0001Z"
                                        fill="white"/>
                                    <path
                                        d="M15 9.99992C14.558 9.99992 14.1341 9.82432 13.8215 9.51176C13.509 9.1992 13.3334 8.77528 13.3334 8.33325V4.99992C13.3334 4.55789 13.509 4.13397 13.8215 3.82141C14.1341 3.50885 14.558 3.33325 15 3.33325C15.4421 3.33325 15.866 3.50885 16.1786 3.82141C16.4911 4.13397 16.6667 4.55789 16.6667 4.99992V8.33325C16.6667 8.77528 16.4911 9.1992 16.1786 9.51176C15.866 9.82432 15.4421 9.99992 15 9.99992Z"
                                        fill="white"/>
                                    <path
                                        d="M8.33331 30.0001C7.98964 30.0003 7.65431 29.8942 7.37325 29.6965C7.09218 29.4987 6.87912 29.2189 6.76325 28.8954C6.64737 28.5718 6.63434 28.2204 6.72595 27.8891C6.81756 27.5579 7.00932 27.2631 7.27497 27.0451C9.94804 24.8573 12.1516 22.1521 13.7533 19.0917C15.5023 15.7367 16.4966 12.0398 16.6666 8.26007C16.6949 7.82124 16.8918 7.41035 17.2161 7.11338C17.5404 6.8164 17.967 6.65636 18.4066 6.66673C18.6256 6.67616 18.8405 6.72866 19.0391 6.82124C19.2378 6.91383 19.4162 7.04467 19.5642 7.20629C19.7122 7.36791 19.8268 7.55713 19.9016 7.76312C19.9764 7.9691 20.0098 8.18781 20 8.40673C19.8079 12.676 18.6838 16.8514 16.7066 20.6401C14.8994 24.0964 12.4117 27.1516 9.39331 29.6217C9.09453 29.8669 8.71982 30.0007 8.33331 30.0001Z"
                                        fill="white"/>
                                    <path
                                        d="M31.6667 36.6668C31.2878 36.6663 30.9204 36.5368 30.6251 36.2996C30.3297 36.0624 30.1239 35.7316 30.0417 35.3618L27.25 22.8018C27.1795 22.4785 27.0005 22.1891 26.7428 21.9816C26.4851 21.774 26.1642 21.6609 25.8334 21.6609C25.5025 21.6609 25.1816 21.774 24.9239 21.9816C24.6662 22.1891 24.4872 22.4785 24.4167 22.8018L21.625 35.3618C21.5809 35.5788 21.494 35.7848 21.3694 35.9679C21.2448 36.1509 21.0849 36.3073 20.8992 36.4278C20.7135 36.5484 20.5056 36.6308 20.2877 36.6701C20.0697 36.7094 19.8462 36.7049 19.63 36.6568C19.4139 36.6088 19.2094 36.5181 19.0287 36.3902C18.848 36.2622 18.6946 36.0995 18.5774 35.9116C18.4603 35.7237 18.3817 35.5143 18.3464 35.2957C18.3111 35.0771 18.3197 34.8537 18.3717 34.6384L21.1667 22.0801C21.4037 21.0192 21.9951 20.0707 22.8434 19.391C23.6917 18.7112 24.7463 18.3408 25.8334 18.3408C26.9204 18.3408 27.975 18.7112 28.8233 19.391C29.6717 20.0707 30.2631 21.0192 30.5 22.0801L33.2917 34.6384C33.3875 35.0699 33.3081 35.5217 33.0709 35.8945C32.8337 36.2674 32.4581 36.5308 32.0267 36.6268C31.9085 36.6529 31.7878 36.6663 31.6667 36.6668Z"
                                        fill="white"/>
                                    <path
                                        d="M16.6667 26.6666C16.3991 26.6669 16.1354 26.6023 15.8983 26.4783C13.6299 25.304 11.7015 23.5661 10.2983 21.4316C9.4283 20.0961 8.78255 18.6273 8.38665 17.0833C8.28692 16.6591 8.35727 16.2128 8.58263 15.8398C8.80798 15.4669 9.17043 15.1971 9.59231 15.0881C10.0142 14.9792 10.462 15.0397 10.8397 15.2569C11.2175 15.4741 11.4952 15.8305 11.6133 16.25C11.9185 17.4437 12.4173 18.5793 13.09 19.6116C14.1808 21.2651 15.6773 22.6113 17.4367 23.5216C17.7676 23.6939 18.0312 23.9723 18.1852 24.3122C18.3392 24.6521 18.3746 25.0339 18.2859 25.3963C18.1972 25.7587 17.9894 26.0809 17.6958 26.3112C17.4022 26.5416 17.0398 26.6667 16.6667 26.6666Z"
                                        fill="white"/>
                                    <path
                                        d="M30 30.0001H21.6667C21.2246 30.0001 20.8007 29.8245 20.4882 29.5119C20.1756 29.1994 20 28.7754 20 28.3334C20 27.8914 20.1756 27.4675 20.4882 27.1549C20.8007 26.8423 21.2246 26.6667 21.6667 26.6667H30C30.442 26.6667 30.866 26.8423 31.1785 27.1549C31.4911 27.4675 31.6667 27.8914 31.6667 28.3334C31.6667 28.7754 31.4911 29.1994 31.1785 29.5119C30.866 29.8245 30.442 30.0001 30 30.0001Z"
                                        fill="white"/>
                                </svg>
                            </div>
                            <h3>آموزش زبان</h3>
                            <svg class="card-divider" width="184" height="2" viewBox="0 0 184 2" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path opacity="0.4" d="M0.5 1H183" stroke="white" stroke-linecap="round"/>
                            </svg>
                        </div>
                    </div>
                </div>
                <div class="col-md-4 px-0 meeting-content " :class="{ active: meetActive }"
                     @click="activeClick('meeting')">
                    <div class="card card-meeting mx-2">
                        <div class="card-body">
                            <div class="card-meeting-icon">
                                <svg width="41" height="40" viewBox="0 0 41 40" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M8.85693 16.0994C8.85693 15.3874 9.43407 14.8103 10.146 14.8103C13.0163 14.8103 15.3775 17.1066 15.3775 19.981C15.3775 22.8556 13.0163 25.1517 10.146 25.1517C9.43407 25.1517 8.85693 24.5746 8.85693 23.8627C8.85693 23.1507 9.43407 22.5736 10.146 22.5736C11.6304 22.5736 12.7993 21.3941 12.7993 19.981C12.7993 18.568 11.6304 17.3884 10.146 17.3884C9.43407 17.3884 8.85693 16.8113 8.85693 16.0994Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M10.2633 6.25656C10.969 6.16252 11.6173 6.65836 11.7114 7.36405C11.9375 9.061 13.4221 10.399 15.2487 10.399C15.9607 10.399 16.5378 10.9762 16.5378 11.6881C16.5378 12.4 15.9607 12.9771 15.2487 12.9771C12.1435 12.9771 9.55448 10.6959 9.15585 7.7046C9.06181 6.99891 9.55765 6.3506 10.2633 6.25656Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M15.2768 29.0955C13.0847 29.0955 11.3419 30.84 11.3419 32.9498C11.3419 33.1375 11.3555 33.3212 11.3816 33.5005C11.4842 34.205 10.9963 34.8593 10.2918 34.9619C9.58731 35.0645 8.93303 34.5765 8.83042 33.872C8.78647 33.5703 8.76379 33.2623 8.76379 32.9498C8.76379 29.3785 11.6987 26.5173 15.2768 26.5173C15.9887 26.5173 16.5658 27.0945 16.5658 27.8064C16.5658 28.5183 15.9887 29.0955 15.2768 29.0955Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M19.2176 6.74234C19.2924 3.32931 22.1205 0.617676 25.5573 0.617676C28.8716 0.617676 31.6199 3.13939 31.8787 6.38008C34.74 6.9757 36.9154 9.47887 36.9154 12.5099C36.9154 13.2962 36.768 14.0487 36.5001 14.7416C38.8967 15.6293 40.6161 17.9096 40.6161 20.6072C40.6161 23.17 39.0636 25.3556 36.854 26.3286C37.1583 27.0611 37.3266 27.8635 37.3266 28.7044C37.3266 31.8518 34.9261 34.4032 31.9342 34.8911C31.098 37.5051 28.6239 39.3824 25.7233 39.3824C22.1452 39.3824 19.2103 36.5212 19.2103 32.9499C19.2103 32.238 19.7874 31.6608 20.4993 31.6608C21.2113 31.6608 21.7884 32.238 21.7884 32.9499C21.7884 35.0598 23.5312 36.8043 25.7233 36.8043C27.72 36.8043 29.3486 35.3531 29.6184 33.5006C29.7106 32.8671 30.2538 32.3973 30.894 32.3973C33.0191 32.3973 34.7484 30.6939 34.7484 28.7044C34.7484 27.8197 34.4315 27.0088 33.898 26.3711C33.5944 26.0082 33.5141 25.5081 33.6886 25.0684C33.8632 24.6286 34.2646 24.3198 34.7345 24.2639C36.6116 24.0406 38.038 22.4733 38.038 20.6072C38.038 18.6457 36.4619 17.0138 34.4451 16.9263C33.9569 16.9051 33.5227 16.6097 33.3237 16.1634C33.1247 15.7171 33.1951 15.1967 33.5056 14.8194C34.0277 14.1848 34.3372 13.3832 34.3372 12.5099C34.3372 10.4955 32.666 8.82357 30.5664 8.82357C30.1949 8.82357 29.8414 8.66327 29.5967 8.38376C29.3519 8.10426 29.2396 7.73273 29.2886 7.36445C29.3096 7.20672 29.3205 7.04545 29.3205 6.88113C29.3205 4.86456 27.6547 3.1958 25.5573 3.1958C23.46 3.1958 21.7942 4.86454 21.7942 6.88113C21.7942 7.59306 21.2171 8.17019 20.5051 8.17019H20.4993C19.7873 8.17019 19.2102 7.59306 19.2102 6.88113C19.2102 6.83424 19.2127 6.78794 19.2176 6.74234Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M21.8985 6.74234C21.8237 3.32931 18.9956 0.617676 15.5588 0.617676C12.2445 0.617676 9.4962 3.13939 9.23735 6.38008C6.37609 6.9757 4.20073 9.47887 4.20073 12.5099C4.20073 13.2962 4.34805 14.0487 4.61597 14.7416C2.21943 15.6293 0.499945 17.9096 0.499945 20.6072C0.499945 23.17 2.05254 25.3556 4.26205 26.3286C3.9578 27.0611 3.78952 27.8635 3.78952 28.7044C3.78952 31.8518 6.19 34.4032 9.18187 34.8911C10.0181 37.5051 12.4922 39.3824 15.3928 39.3824C18.9709 39.3824 21.9058 36.5212 21.9058 32.9499C21.9058 32.238 21.3287 31.6608 20.6167 31.6608C19.9048 31.6608 19.3277 32.238 19.3277 32.9499C19.3277 35.0598 17.5849 36.8043 15.3928 36.8043C13.3961 36.8043 11.7674 35.3531 11.4977 33.5006C11.4055 32.8671 10.8623 32.3973 10.2221 32.3973C8.09701 32.3973 6.36764 30.6939 6.36764 28.7044C6.36764 27.8197 6.68456 27.0088 7.21805 26.3711C7.52164 26.0082 7.60203 25.5081 7.42747 25.0684C7.25291 24.6286 6.85146 24.3198 6.38163 24.2639C4.50446 24.0406 3.07807 22.4733 3.07807 20.6072C3.07807 18.6457 4.65418 17.0138 6.67098 16.9263C7.15915 16.9051 7.59338 16.6097 7.79238 16.1634C7.99138 15.7171 7.92095 15.1967 7.61049 14.8194C7.08835 14.1848 6.77886 13.3832 6.77886 12.5099C6.77886 10.4955 8.45013 8.82357 10.5497 8.82357C10.9212 8.82357 11.2746 8.66327 11.5194 8.38376C11.7642 8.10426 11.8765 7.73273 11.8274 7.36445C11.8065 7.20672 11.7956 7.04545 11.7956 6.88113C11.7956 4.86456 13.4614 3.1958 15.5588 3.1958C17.6561 3.1958 19.3219 4.86454 19.3219 6.88113C19.3219 7.59306 19.899 8.17019 20.611 8.17019H20.6168C21.3288 8.17019 21.9059 7.59306 21.9059 6.88113C21.9059 6.83424 21.9034 6.78794 21.8985 6.74234Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M25.6226 19.981C25.6226 17.1066 27.9837 14.8103 30.854 14.8103C31.566 14.8103 32.1431 15.3874 32.1431 16.0994C32.1431 16.8113 31.566 17.3884 30.854 17.3884C29.3697 17.3884 28.2007 18.568 28.2007 19.981C28.2007 21.3941 29.3696 22.5736 30.854 22.5736C31.566 22.5736 32.1431 23.1507 32.1431 23.8627C32.1431 24.5746 31.566 25.1517 30.854 25.1517C27.9837 25.1517 25.6226 22.8556 25.6226 19.981Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M30.7369 6.25656C31.4425 6.3506 31.9384 6.99891 31.8443 7.7046C31.4457 10.6959 28.8567 12.9771 25.7515 12.9771C25.0395 12.9771 24.4624 12.4 24.4624 11.6881C24.4624 10.9762 25.0395 10.399 25.7515 10.399C27.5781 10.399 29.0627 9.061 29.2888 7.36405C29.3829 6.65836 30.0312 6.16252 30.7369 6.25656Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M24.4342 27.8064C24.4342 27.0945 25.0113 26.5173 25.7233 26.5173C29.3013 26.5173 32.2362 29.3785 32.2362 32.9498C32.2362 33.2623 32.2136 33.5703 32.1696 33.872C32.067 34.5765 31.4127 35.0645 30.7082 34.9619C30.0037 34.8593 29.5158 34.205 29.6184 33.5005C29.6445 33.3212 29.6581 33.1375 29.6581 32.9498C29.6581 30.84 27.9153 29.0955 25.7233 29.0955C25.0113 29.0955 24.4342 28.5183 24.4342 27.8064Z"
                                          fill="white"/>
                                </svg>
                            </div>
                            <h3>مشاوره</h3>
                            <svg class="card-divider" width="184" height="2" viewBox="0 0 184 2" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path opacity="0.4" d="M0.5 1H183" stroke="white" stroke-linecap="round"/>
                            </svg>
                        </div>
                    </div>
                </div>
                <div class="col-md-4 px-0 program-content " :class="{ active: proActive }"
                     @click="activeClick('program')">
                    <div class="card card-program mx-2">
                        <div class="card-body">
                            <div class="card-program-icon">
                                <svg width="33" height="36" viewBox="0 0 33 36" fill="none"
                                     xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M2.91834 3.10812L6.07478 30.021C6.08045 30.0693 6.08329 30.1179 6.08329 30.1666C6.08329 30.249 6.09545 30.298 6.10394 30.3227C6.11213 30.3466 6.12058 30.3588 6.1269 30.3664C6.13792 30.3796 6.18186 30.4236 6.30313 30.4539L6.33553 30.4625L16.5022 33.2958C16.5296 33.3034 16.5566 33.312 16.5833 33.3214C16.61 33.312 16.6371 33.3034 16.6644 33.2958L26.7028 30.4982C26.8774 30.4005 26.9838 30.3085 27.0397 30.2414C27.0695 30.2056 27.079 30.1842 27.0813 30.1783C27.0828 30.1745 27.0833 30.1731 27.0833 30.1666C27.0833 30.1205 27.0858 30.0744 27.0909 30.0285L30.0909 3.02855C30.0934 3.00598 30.0966 2.98348 30.1003 2.96109C30.1145 2.87591 30.0936 2.80248 30.0255 2.72985C29.9488 2.64801 29.8203 2.58325 29.6666 2.58325H3.33329C3.20542 2.58325 3.12778 2.62707 3.06568 2.69805C2.99868 2.77463 2.92994 2.91233 2.91834 3.10812ZM16.4308 33.3863C16.4307 33.3863 16.4318 33.3858 16.4341 33.3851L16.4308 33.3863ZM0.416626 3.16659C0.416626 1.63824 1.49137 0.083252 3.33329 0.083252H29.6666C31.2955 0.083252 32.8596 1.46616 32.5724 3.33409L29.5821 30.2463C29.5431 31.5826 28.5253 32.3848 27.7256 32.7846C27.6541 32.8204 27.5793 32.8492 27.5022 32.8707L17.4326 35.677C17.1556 35.7974 16.8444 35.8749 16.5208 35.8749C16.2584 35.8749 15.934 35.821 15.6288 35.6477L5.67851 32.8746C5.13936 32.7364 4.60746 32.4482 4.20635 31.9668C3.80939 31.4905 3.60047 30.8962 3.58431 30.2483L0.425136 3.31219C0.419467 3.26386 0.416626 3.21525 0.416626 3.16659Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M14.1666 8.4165C14.857 8.4165 15.4166 8.97615 15.4166 9.6665V24.6665C15.4166 25.0597 15.2316 25.4299 14.9172 25.666C14.6029 25.9021 14.1957 25.9766 13.8181 25.8669L8.65145 24.3669C7.98846 24.1745 7.60705 23.481 7.79953 22.818C7.992 22.155 8.68549 21.7736 9.34847 21.9661L12.9166 23.002V9.6665C12.9166 8.97615 13.4763 8.4165 14.1666 8.4165Z"
                                          fill="white"/>
                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                          d="M25.2397 9.50668C25.328 10.1914 24.8446 10.818 24.1599 10.9064L20.0833 11.4324V17.1989L23.8009 16.5993C24.1625 16.5409 24.5315 16.6442 24.8104 16.8817C25.0893 17.1191 25.2499 17.467 25.2499 17.8333V23.1666C25.2499 23.7402 24.8596 24.2402 24.3031 24.3793L18.3031 25.8793C17.6334 26.0468 16.9547 25.6396 16.7873 24.9698C16.6198 24.3001 17.027 23.6214 17.6968 23.454L22.7499 22.1907V19.3011L19.0323 19.9007C18.6707 19.959 18.3017 19.8558 18.0228 19.6183C17.7439 19.3808 17.5833 19.0329 17.5833 18.6666V10.3333C17.5833 9.70479 18.05 9.17402 18.6733 9.09359L23.84 8.42692C24.5246 8.33857 25.1513 8.822 25.2397 9.50668Z"
                                          fill="white"/>
                                </svg>
                            </div>
                            <h3>آموزش برنامه نویسی</h3>
                            <svg class="card-divider" width="184" height="2" viewBox="0 0 184 2" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path opacity="0.4" d="M0.5 1H183" stroke="white" stroke-linecap="round"/>
                            </svg>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div class="col-md-12 px-0 details-content">
            <div class="col-md-8 mx-auto">
                <div class="card-details">
                    <ul>
                        <li>زبان انگلیسی</li>
                        <li class="my-1">زبان عربی</li>
                        <li class="my-1">زبان آلمانی</li>
                        <li>زبان ایتالیایی</li>
                    </ul>
                    <ul>
                        <li>زبان کره ای</li>
                        <li class="my-1">زبان چینی</li>
                        <li class="my-1">زبان فرانسه</li>
                        <li>زبان اسپانیایی</li>
                    </ul>
                    <ul>
                        <li>زبان کره ای</li>
                        <li class="my-1">زبان چینی</li>
                        <li class="my-1">زبان فرانسه</li>
                        <li>زبان اسپانیایی</li>
                    </ul>
                </div>
            </div>
        </div>
        <div class="col-md-12 px-0">
            <div class="row">
                <div class="col-md-5 position-relative" style="height: 830px">
                    <div style="margin-top: 270px">
                        <div v-for="(item, index) in this.cards" v-bind:key="item.key" class="master-card-content position-absolute "
                             :id="'item-'+ index"
                             :class="[ {centerItem: index == half}, {'master-active': index == half},
                             {upItem: index < half},
                             {downItem: index > half}]"
                             @click="itemScroll(index)">
                            <div class="master-card " :class="[{'master-card-active': index == half}]">
                                <div class="d-block">
                                    <svg width="73" height="66" viewBox="0 0 73 66" fill="none"
                                         xmlns="http://www.w3.org/2000/svg">
                                        <g filter="url(#filter0_d_506_984)">
                                            <g clip-path="url(#clip0_506_984)">
                                                <rect x="2" width="68.4127" height="48" rx="8" fill="white"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M2 0H31.3197V22.4H2V0Z"
                                                      fill="#1A47B8"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M31.3197 0V3.2H70.4127V0H31.3197ZM31.3197 6.4V9.6H70.4127V6.4H31.3197ZM31.3197 12.8V16H70.4127V12.8H31.3197ZM31.3197 19.2V22.4H70.4127V19.2H31.3197ZM2 25.6V28.8H70.4127V25.6H2ZM2 32V35.2H70.4127V32H2ZM2 38.4V41.6H70.4127V38.4H2ZM2 44.8V48H70.4127V44.8H2Z"
                                                      fill="#F93939"/>
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M5.25781 3.19995V6.39995H8.51556V3.19995H5.25781ZM11.7733 3.19995V6.39995H15.0311V3.19995H11.7733ZM18.2888 3.19995V6.39995H21.5465V3.19995H18.2888ZM24.8043 3.19995V6.39995H28.062V3.19995H24.8043ZM21.5465 6.39995V9.59995H24.8043V6.39995H21.5465ZM15.0311 6.39995V9.59995H18.2888V6.39995H15.0311ZM8.51556 6.39995V9.59995H11.7733V6.39995H8.51556ZM5.25781 9.59995V12.8H8.51556V9.59995H5.25781ZM11.7733 9.59995V12.8H15.0311V9.59995H11.7733ZM18.2888 9.59995V12.8H21.5465V9.59995H18.2888ZM24.8043 9.59995V12.8H28.062V9.59995H24.8043ZM5.25781 16V19.2H8.51556V16H5.25781ZM11.7733 16V19.2H15.0311V16H11.7733ZM18.2888 16V19.2H21.5465V16H18.2888ZM24.8043 16V19.2H28.062V16H24.8043ZM21.5465 12.8V16H24.8043V12.8H21.5465ZM15.0311 12.8V16H18.2888V12.8H15.0311ZM8.51556 12.8V16H11.7733V12.8H8.51556Z"
                                                      fill="white"/>
                                            </g>
                                        </g>
                                        <defs>
                                            <filter id="filter0_d_506_984" x="0" y="0" width="72.4127" height="66"
                                                    filterUnits="userSpaceOnUse"
                                                    color-interpolation-filters="sRGB">
                                                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                                <feColorMatrix in="SourceAlpha" type="matrix"
                                                               values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0"
                                                               result="hardAlpha"/>
                                                <feMorphology radius="18" operator="erode" in="SourceAlpha"
                                                              result="effect1_dropShadow_506_984"/>
                                                <feOffset dy="16"/>
                                                <feGaussianBlur stdDeviation="10"/>
                                                <feColorMatrix type="matrix"
                                                               values="0 0 0 0 0.858333 0 0 0 0 0.196701 0 0 0 0 0.196701 0 0 0 1 0"/>
                                                <feBlend mode="normal" in2="BackgroundImageFix"
                                                         result="effect1_dropShadow_506_984"/>
                                                <feBlend mode="normal" in="SourceGraphic"
                                                         in2="effect1_dropShadow_506_984" result="shape"/>
                                            </filter>
                                            <clipPath id="clip0_506_984">
                                                <rect x="2" width="68.4127" height="48" rx="8" fill="white"/>
                                            </clipPath>
                                        </defs>
                                    </svg>
                                    <div class="title">
                                        <h3 class="py-2" :class="{'text-dark': index != half}">{{ item.name }}</h3>
                                        <h6 class="mt-0">{{ item.title }}</h6>
                                        <p class="my-0"> {{ item.rate }} (نظر ۹۸)
                                            <svg width="18" height="19" viewBox="0 0 18 19" fill="none"
                                                 xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd"
                                                      d="M11.001 2.14607C10.56 1.2597 9.87059 0.606201 8.99893 0.606201C8.12822 0.606201 7.43671 1.25858 6.99154 2.14427L5.52429 5.07878L5.52202 5.08337C5.47799 5.17325 5.37275 5.30116 5.21418 5.41873C5.05615 5.53591 4.90283 5.60004 4.80456 5.61695L4.80367 5.61711L2.14754 6.0584C1.18912 6.21814 0.384213 6.68456 0.123343 7.5015C-0.137338 8.31784 0.247195 9.16439 0.933032 9.85023L2.9997 11.9169C3.08104 11.9982 3.17216 12.1515 3.22932 12.3511C3.28612 12.5495 3.29092 12.7295 3.26547 12.845L3.26511 12.8466L2.6744 15.4007C2.42811 16.4651 2.51353 17.5218 3.27116 18.0746C4.02832 18.6271 5.06135 18.3875 6.00228 17.8291L8.48928 16.3568L8.49085 16.3559C8.60271 16.2914 8.78694 16.2416 9.0031 16.2416C9.22083 16.2416 9.4013 16.2921 9.50635 16.3543L11.9983 17.8294C12.9403 18.3859 13.9746 18.6298 14.7317 18.0779C15.4899 17.5252 15.5712 16.4665 15.3257 15.4013L14.7348 12.8466L14.7345 12.845C14.709 12.7295 14.7138 12.5496 14.7706 12.3511C14.8278 12.1515 14.9189 11.9982 15.0002 11.9169L17.0654 9.85173L17.0663 9.85088C17.7564 9.16506 18.1421 8.31785 17.8794 7.50036C17.6169 6.68394 16.8105 6.21809 15.8527 6.05845L13.1944 5.61679"
                                                      fill="#FF9B64"/>
                                            </svg>
                                        </p>
                                    </div>
                                    <div class="d-inline-block">
                                        <img src="../../../public/assets/images/profile.png" alt="">
                                    </div>
                                </div>
                                <div class="content">
                                    <p>{{ item.description }}</p>
                                </div>
                                <div class="footer">
                                    <a :href="item.url" class="btn btn-footer" :id="'btn-'+ index" :class="[{'d-none': index != half}]">
                                        <svg width="16" height="12" viewBox="0 0 16 12" fill="none"
                                             xmlns="http://www.w3.org/2000/svg">
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                  d="M6.4169 0.499709C6.66098 0.743786 6.66098 1.13951 6.4169 1.38359L1.80051 5.99998L6.4169 10.6164C6.66098 10.8605 6.66098 11.2562 6.4169 11.5003C6.17282 11.7443 5.77709 11.7443 5.53302 11.5003L0.474684 6.44193C0.357474 6.32472 0.291626 6.16574 0.291626 5.99998C0.291626 5.83422 0.357474 5.67525 0.474684 5.55804L5.53302 0.499709C5.77709 0.255631 6.17282 0.255631 6.4169 0.499709Z"
                                                  fill="white"/>
                                            <path fill-rule="evenodd" clip-rule="evenodd"
                                                  d="M0.43335 6C0.43335 5.65482 0.713172 5.375 1.05835 5.375H15.0834C15.4285 5.375 15.7084 5.65482 15.7084 6C15.7084 6.34518 15.4285 6.625 15.0834 6.625H1.05835C0.713172 6.625 0.43335 6.34518 0.43335 6Z"
                                                  fill="white"/>
                                        </svg>
                                        مشاهده کلاس ها

                                    </a>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-md-7 master">
                    <div class="circle-bg"></div>
                    <div class="dashed-bg"></div>
                    <div class="master-content">
                        <h3 class="master-title">با اساتید مورد تایید لرنیا همراه شوید</h3>
                        <p class="master-text">اساتید مورد تایید لرنیا ، با بررسی کامل و دریافت بازخورد از دانش آموزان
                            به شما معرفی
                            خواهند شد تا تجربه آموزش بهتر، همراه با آرامش خاطر را داشته باشید.</p>
                        <a href="#!" class="btn btn-master">
                            جستجوی بهترین استاتید
                            <svg width="16" height="12" viewBox="0 0 16 12" fill="none"
                                 xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                      d="M6.4169 0.499709C6.66098 0.743786 6.66098 1.13951 6.4169 1.38359L1.80051 5.99998L6.4169 10.6164C6.66098 10.8605 6.66098 11.2562 6.4169 11.5003C6.17282 11.7443 5.77709 11.7443 5.53302 11.5003L0.474684 6.44193C0.357474 6.32472 0.291626 6.16574 0.291626 5.99998C0.291626 5.83422 0.357474 5.67525 0.474684 5.55804L5.53302 0.499709C5.77709 0.255631 6.17282 0.255631 6.4169 0.499709Z"
                                      fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                      d="M0.43335 6C0.43335 5.65482 0.713172 5.375 1.05835 5.375H15.0834C15.4285 5.375 15.7084 5.65482 15.7084 6C15.7084 6.34518 15.4285 6.625 15.0834 6.625H1.05835C0.713172 6.625 0.43335 6.34518 0.43335 6Z"
                                      fill="white"/>
                            </svg>
                        </a>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'HelloWorld',
    props: {
        direction: {
            type: String,
            default: 'down'
        },
        title: String,
        icon: String,
        position: String,
        hideArrow: Boolean,
        tag: {
            type: String,
            default: 'div'
        }
    },
    data() {
        return {
            langActive: false,
            meetActive: false,
            proActive: false,
            scrollUp: false,
            scrollDown: false,
            upActive: false,
            centerUpActive: false,
            centerDownActive: false,
            downActive: false,
            cards: null,
            isLoop: false,
            half: 0,
        }
    },
    mounted() {
        this.getCards();
    },
    watch() {
        // this.cards;
    },
    methods: {
        getCards() {
            axios.get("/ajax/cards/get").then(res => {
                this.cards = res.data;
                this.half = parseInt(res.data.length / 2);
            })
        },
        activeClick(type) {

            if (type == "lang") {
                this.langActive = true;
                this.meetActive = false;
                this.proActive = false;
            } else if (type == 'meeting') {
                this.langActive = false;
                this.meetActive = true;
                this.proActive = false;
            } else {
                this.langActive = false;
                this.meetActive = false;
                this.proActive = true;
            }
        },
        itemScroll(pos) {
            var item = $("#item-"+ pos);
            var next = $(".centerItem")
            if (item.hasClass('upItem')) {
                setTimeout(function (){
                    var btnItem = item[0].firstElementChild.lastElementChild.firstElementChild;
                    var btnNext = next[0].firstElementChild.lastElementChild.firstElementChild;
                    var titleItem = item[0].firstElementChild.firstElementChild.children[1].firstElementChild;
                    var titleNext = next[0].firstElementChild.firstElementChild.children[1].firstElementChild;
                    item.removeClass('upItem');
                    item.addClass('upCenter');
                    item.addClass('centerItem');
                    item.addClass('master-active');
                    next.removeClass('centerItem');
                    next.addClass('centerDown');
                    next.addClass('downItem');
                    next.removeClass('master-active');
                    $(btnItem).removeClass('d-none');
                    $(btnNext).addClass('d-none');

                    $(titleItem).removeClass('text-dark');
                    $(titleNext).addClass('text-dark');

                    $(next[0].firstElementChild).removeClass('master-card-active')
                    $(item[0].firstElementChild).addClass('master-card-active')
                }, 3)


                setTimeout(function () {
                    item.removeClass('upCenter');
                    $(next).removeClass('centerDown');
                },500)


            } else if (item.hasClass('downItem')) {
                setTimeout(function (){
                    var btnItem = item[0].firstElementChild.lastElementChild.firstElementChild;
                    var btnNext = next[0].firstElementChild.lastElementChild.firstElementChild;
                    var titleItem = item[0].firstElementChild.firstElementChild.children[1].firstElementChild;
                    var titleNext = next[0].firstElementChild.firstElementChild.children[1].firstElementChild;
                    item.removeClass('downItem');
                    item.addClass('downCenter');
                    item.addClass('centerItem');
                    item.addClass('master-active');
                    next.removeClass('centerItem');
                    next.addClass('centerUp');
                    next.addClass('upItem');
                    next.removeClass('master-active');
                    $(btnItem).removeClass('d-none');
                    $(btnNext).addClass('d-none');

                    $(titleItem).removeClass('text-dark');
                    $(titleNext).addClass('text-dark');

                    $(next[0].firstElementChild).removeClass('master-card-active')
                    $(item[0].firstElementChild).addClass('master-card-active')
                }, 3)

                setTimeout(function () {
                    item.removeClass('downCenter');
                    $(next).removeClass('centerUp');
                },500)

            }
        },

    }
}


</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->

